coconut/app/controllers/seats_controller.rb

  def show
    @seat = Seat.find(params[:id])
---
SELECT * FROM "seats" WHERE ("seats"."id" = 25)

  def edit
    @seat = Seat.find(params[:id])
---
SELECT * FROM "seats" WHERE ("seats"."id" = 29)

  def create
    @seat = Seat.new(params[:seat])

render :update do |page|
      if @seat.save
---
INSERT INTO "seats" ("name", "updated_at", "flight_id", "baggage", "created_at") VALUES('', '2009-08-06 11:40:20', NULL, NULL, '2009-08-06 11:40:20')

  def update
    @seat = Seat.find(params[:id])

    respond_to do |format|
      if @seat.update_attributes(params[:seat])
---
SELECT * FROM "seats" WHERE ("seats"."id" = 35)
UPDATE "seats" SET "name" = 'Ismail', "baggage" = 17.0, "updated_at" = '2009-08-07 15:05:00' WHERE "id" = 35

  def destroy
    @seat = Seat.find(params[:id])
    @seat.destroy
---
SELECT * FROM "seats" WHERE ("seats"."id" = 25)
DELETE FROM "seats" WHERE "id" = 25

  def flight_seats
    @flight = Flight.find(params[:flight_id])
---
SELECT * FROM "flights" WHERE ("flights"."id" = 2)